use kino_poisk;

INSERT INTO categories VALUES
	('1', 'Драма'),
	('2', 'Документальный'),
	(DEFAULT, 'Комедия'),
	(DEFAULT, 'Боевик'),
	(DEFAULT, 'Аниме'),
	(DEFAULT, 'Биография'),
	(DEFAULT, 'Вестерн'),
	(DEFAULT, 'Детектив'),
	(DEFAULT, 'История'),
	(DEFAULT, 'Мюзикл'),
	(DEFAULT, 'Мультфильм'),
	(DEFAULT, 'Приключения'),
	(DEFAULT, 'Семейный'),
	(DEFAULT, 'Спорт'),
	(DEFAULT, 'Ужасы'),
	(DEFAULT, 'Фантастика');


INSERT INTO film_types VALUES
	(DEFAULT, 'Фильм'),
	(DEFAULT, 'Сериал');
	

INSERT INTO media_types VALUES 
	(DEFAULT, 'Обложка'),
	(DEFAULT, 'Трейлер'),
	(DEFAULT, 'Фильм');

INSERT INTO actors VALUES
	(DEFAULT, 'Леонардо', 'Ди Каприо', '1974-11-11'),
	(DEFAULT, 'Джозеф', 'Гордон-Левитт', '1981-02-17'),
	(DEFAULT, 'Эллиот', 'Пейдж', '1987-02-21'),
	(DEFAULT, 'Том', 'Харди', '1977-09-15'),
	(DEFAULT, 'Киллиан', 'Мёрфи', '1976-05-25'),
	(DEFAULT, 'Кристиан', 'Бэйл', '1974-01-30'),
	(DEFAULT, 'Кэти', 'Холмс', '1978-12-18'),
	(DEFAULT, 'Майкл', 'Кейн', '1933-03-14'),
	(DEFAULT, 'Джоэл', 'Эдгертон', '1974-06-23'),
	(DEFAULT, 'Ник', 'Нолти', '1941-02-08'),
	(DEFAULT, 'Дженнифер', 'Моррисон', '1979-04-12'),
	(DEFAULT, 'Тоби', 'Магуайр', '1975-06-27'),
	(DEFAULT, 'Кэри', 'Маллиган', '1985-05-28');
	

INSERT INTO films VALUES 
	(1, 'Начало', '1', 'Шпионаж фантастического уровня. С помощью сверхтехнологии герой Ди Каприо и его команда проникают в чужие сны', '16', 'США', 'Кристофер Нолан', '160000000', '2010', '12+', '8.660'),
	(2, 'Бэтмен: Начало', '1', 'Миллиардер объявляет войну несправедливости. История супергероя без сверхспобностей глазами Кристофера Нолана', '4', 'США', 'Кристофер Нолан', '150000000', '2005', '16+', '7.906'),
	(3, 'Воин', '1', 'Братья-боксеры встречаются на одном ринге. Том Харди в захватывающей спортивной драме о семейных обидах', '1', 'США', 'Гэвин О\'Коннор', '25000000', '2010', '12+', '8.025'),
	(4, 'Великий Гэтсби', '1', 'Ревущие 1920-е, роскошные вечеринки, деньги и чувства на пределе – ДиКаприо в пышной экранизации Фицджеральда', '1', 'США', 'Баз Лурман', '105000000', '2013', '16+', '7.940'),
	(5, 'Острые козырьки', '2', 'Криминальная сага в стиле ретро о банде и ее лютом боссе. Так популярна, что повысила продажи головных уборов', '2', 'Великобритания', 'Энтони Бирн', '12000000', '2013', '16+', '8.398');

INSERT INTO actors_films VALUES
	('1', '1', '1'),
	('2', '1', '4'),	
	('3', '2', '1'),	
	('4', '3', '1'),	
	('5', '4', '1'),	
	('6', '4', '3'),	
	('7', '5', '1'),	
	('8', '5', '2'),
	('9', '5', '5'),	
	('10', '6', '2'),	
	('11', '7', '2'),	
	('12', '8', '2'),	
	('13', '9', '3'),	
	('14', '10', '3'),	
	('15', '11', '4'),
	('16', '12', '4'),	
	('17', '13', '4');

INSERT INTO media VALUES
	('1', '1', '1', 'inception_cover.png'),
	('2', '1', '2', 'inception_trailer.mp4'),
	('3', '1', '3', 'inception_film.mp4'),
	('4', '2', '1', 'betmen_begins_cover.png'),
	('5', '2', '2', 'betmen_begins_trailer.mp4'),
	('6', '2', '3', 'betmen_begins_film.mp4'),
	('7', '3', '1', 'warrior_cover.png'),
	('8', '3', '2', 'warrior_trailer.mp4'),
	('9', '3', '3', 'warrior_film.mp4'),
	('10', '4', '1', 'the_great_gatsby_cover.png'),
	('11', '4', '2', 'the_great_gatsby_trailer.mp4'),
	('12', '4', '3', 'the_great_gatsby_film.mp4'),
	('13', '5', '1', 'peaky_blinders_cover.png'),
	('14', '5', '2', 'peaky_blinders_trailer.mp4'),
	('15', '5', '3', 'peaky_blinders_S1E1.mp4');
	

INSERT INTO users VALUES
	('1', 'David', 'Chulakov', '123@mail.ru', '2002-03-13'),
	('2', 'Garry', 'Kasparov', 'shahimat@yandex.ru', '1956-05-18'),
	('3', 'Alex', 'Durov', 'hacker@gmail.com', '1978-03-28'),
	('4', 'Marry', 'Winchester', 'prizraki@yahoo.com', '1968-02-10'),
	('5', 'Dean', 'Winchester', 'beerandgirls@mail.ru', '1985-08-15');

INSERT INTO films_viewed VALUES 
	('1', '1', '1'),
	('2', '1', '2'),
	('3', '1', '3'),
	('4', '1', '4'),
	('5', '1', '5'),
	('6', '2', '2'),
	('7', '2', '3'),
	('8', '4', '5'),
	('9', '5', '1'),
	('10', '5', '5');

INSERT INTO film_reviews VALUES
	('1', '1', '1', 'Хороший фильм, понял только, пересмотрев пару раз. Кристофер Нолан молодец', '5'),
	('2', '5', '5', 'Классный сериал!', '5'),
	('3', '3', '2', 'Не понравилось', '2');





